[
    {
        "id": "intro",
        "text": "90% of algorithmic traders lose money. They copy code from YouTube, load up an RSI indicator, and watch their account bleed out. They blame the market. But the market isn’t rigged—your math is just lazy. Today, we aren't building a bot to 'get rich.' We are building a forensic tool in Python to prove, mathematically, why your favorite indicators are lying to you.",
        "moduleId": "intro"
    },
    {
        "id": "audience",
        "text": "Forget complex finance degrees. If you understand basic logic, you can do this. But warning: we are going to break some golden rules. We aren't looking for 'signals.' We are hunting for the truth hidden inside the noise.",
        "moduleId": "intro"
    },
    {
        "id": "data_trap",
        "text": "Step one is where the amateurs die. Data. You think downloading a CSV of Bitcoin prices is enough? Wrong. Raw market data is a minefield. Zero-volume glitches. Weekend gaps. If your code sees a glitch as a 'dip,' it buys. And you go broke. We don't just 'clean' data; we sanitize it. If the foundation is rotten, the house collapses.",
        "moduleId": "data_prep"
    },
    {
        "id": "features_velocity",
        "text": "Most traders stare at the Price. But a machine learning model doesn't care about Price. It cares about Velocity. Is the move accelerating? Is it exhausted? We don't feed the model '$200.' We feed it the derivative of the price. We translate 'lines on a chart' into physics.",
        "moduleId": "feature_engineering"
    },
    {
        "id": "the_lie",
        "text": "Now, the uncomfortable truth. Everyone asks: 'Will the price go up?' That is the wrong question. It’s impossible to answer. The real question is: 'Will the price go up *before* it goes down?' This is a game of barriers. We simulate thousands of trades with a 2-to-1 risk ratio. We aren't predicting the future; we are labeling the past.",
        "moduleId": "target_creation"
    },
    {
        "id": "visualization_chaos",
        "text": "When we map this out, the chart looks terrifying. It’s not trends. It’s chaos. The 'Unclear Zone' dominates 80% of the timeline. This is why you get stopped out. The market isn't trending; it's just breathing. And your indicators are screaming 'BUY' during a exhale.",
        "moduleId": "analysis"
    },
    {
        "id": "reality_check",
        "text": "Let’s put the most popular indicator in the world to the test: The RSI. If the books are right, low RSI should predict a bounce. We run the numbers on 10 years of data. The result?",
        "moduleId": "hypothesis"
    },
    {
        "id": "reveal",
        "text": "Nothing. A flat line. The probability of going up after a 'perfect' RSI signal is exactly 50/50. It is a coin flip wrapped in math.",
        "moduleId": "outro"
    },
    {
        "id": "conclusion",
        "text": "Does this mean Algo Trading is dead? No. It means simple answers are dead. We found the noise. Now, in the next video, we build the filter.",
        "moduleId": "outro"
    }
]